rupa/z
olets/zsh-abbr kind:defer

supercrabtree/k

ohmyzsh/ohmyzsh path:lib/completion.zsh

# Completions
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# Completion styles
belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup

# Keybindings
belak/zsh-utils path:editor

# History
belak/zsh-utils path:history

# Utilities
zshzoo/macos
belak/zsh-utils path:utility
ohmyzsh/ohmyzsh path:plugins/extract

# Other Fish-like features
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
zsh-users/zsh-autosuggestions               # Auto-suggestions
zsh-users/zsh-history-substring-search      # Up/Down to search history
